src/cf/Catalogs/ОчередиRMQ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ОчередиRMQ</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ЭкземплярRMQ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЭкземплярыRMQ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Очередь</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТочкаОбмена</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТочкиОбменаRMQ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлючМаршрутизации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Catalogs/ОчередиRMQ/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаСервере
Процедура СоздатьТочкуИОчередьВRabbitMQНаСервере() 
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("Адрес", Объект.ЭкземплярRMQ.ИмяСервера);
	СтруктураПараметров.Вставить("Порт", Объект.ЭкземплярRMQ.Порт);
	СтруктураПараметров.Вставить("Логин", Объект.ЭкземплярRMQ.Имя);
	СтруктураПараметров.Вставить("Пароль", Объект.ЭкземплярRMQ.Пароль);
	СтруктураПараметров.Вставить("ВиртуальныйХост", Объект.ЭкземплярRMQ.ВиртуальныйХост);	
	СтруктураПараметров.Вставить("ТочкаОбмена", Объект.ТочкаОбмена.Наименование);
	СтруктураПараметров.Вставить("Канал", Объект.ТочкаОбмена.Канал);
	СтруктураПараметров.Вставить("ИмяОчереди", Объект.Очередь);
	СтруктураПараметров.Вставить("КлючМаршрутизации", Объект.КлючМаршрутизации);
	
	Обработки.ОбменRMQ.СоздатьТочкуИОчередьВRabbitMQ(СтруктураПараметров);  
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьТочкуИОчередьВRabbitMQ(Команда) 
	
	СоздатьТочкуИОчередьВRabbitMQНаСервере();   
		
КонецПроцедуры
